# CannotCopyNestedLinks Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyNestedLinks Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
To copy a nested link, use Copy to Clipboard or Move Copy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyNestedLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyNestedLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyNestedLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace